Repository: amir-qayyum-khan/edx-proctoring
Catalog: edx_proctoring/locale/*/LC_MESSAGES/django.po
Languages: ur

source: internally reviewed
ur: اندرونی جائزہ لیا

source: All Unreviewed
ur: تمام ناظر

source: All Unreviewed Failures
ur: تمام ناپسندیدہ ناکامیاں

source: active proctored exams
ur: فعال پروکرمی امتحان

source: courses with active proctored exams
ur: فعال پروکرمی امتحان کے ساتھ کورس

source: Course Id
ur: کورس کی شناخت

source: Created
ur: تخلیق

source: Download Software Clicked
ur: سافٹ ویئر ڈاؤن لوڈ کردہ کلک کریں

source: Ready To Start
ur: شروع کرنے کے لئے تیار

source: Started
ur: شروع

source: Ready To Submit
ur: جمع کرنے کے لئے تیار

source: Declined
ur: بیان کردہ

source: Timed Out
ur: وقت ختم

source: Submitted
ur: پیش کردہ

source: Second Review Required
ur: دوسرا جائزہ لینے کی ضرورت ہے

source: Verified
ur: تصدیق شدہ

source: Rejected
ur: مسترد

source: Error
ur: غلطی

source: your course
ur: آپ کا کورس

source: Proctoring Session Results Update for {course_name} {exam_name}
ur: {course_name} {exam_name} کے لئے پروکیکشن سیشن کے نتائج اپ ڈیٹ

source: Taking As Proctored Exam
ur: پروکارڈ امتحان کے طور پر لے

source: Proctored Option Available
ur: پروکیکٹ اختیار دستیاب ہے

source: Taking As Open Exam
ur: کھولیں امتحان کے طور پر لے جا رہا ہے

source: Pending Session Review
ur: زیر التواء سیشن کا جائزہ

source: Passed Proctoring
ur: منظور شدہ پروکیکٹنگ

source: Failed Proctoring
ur: ناکام پروکیکٹنگ

source: Proctored Option No Longer Available
ur: پروکیکٹ اختیار ابھی تک دستیاب نہیں ہے

source: Ungraded Practice Exam
ur: غیر رجسٹرڈ پریکٹس کی امتحان

source: Practice Exam Completed
ur: امتحان کی تکمیل مکمل

source: Practice Exam Failed
ur: پریکٹس کی امتحان ناکام ہوگئی

source: Timed Exam
ur: ٹائم کی جانچ

source: pending
ur: زیر التواء

source: satisfactory
ur: اطمینان بخش

source: unsatisfactory
ur: ناگزیر

source: Taking as Proctored
ur: پروکارڈ کے طور پر لے

source: Is Sample Attempt
ur: نمونے کی کوشش ہے

source: Additional Time (minutes)
ur: اضافی وقت (منٹ)

source: Review Policy Exception
ur: جائزہ پالیسی استثنا

source: This email is to let you know that the status of your proctoring session review for %(exam_name)s in <a href="%(course_url)s">%(course_name)s </a> is %(status)s. If you have any questions about proctoring, contact %(platform)s support at %(contact_email)s.
ur: یہ ای میل آپ کو پتہ ہے میں %(exam_name)s کے لئے اپنے proctoring سیشن کا جائزہ لینے کی حیثیت ہے کہ اجازت دینا ہے <a href="%(course_url)s">%(course_name)s</a> %(status)s ہے. اگر آپ کے پاس پروکیکٹنگ کے بارے میں کوئی سوال ہے تو %(contact_email)s پر %(platform)s کی حمایت سے رابطہ کریں.

source: Try a proctored exam
ur: ایک متوقع امتحان کی کوشش کریں

source: Get familiar with proctoring for real exams later in the course. This practice exam has no impact on your grade in the course.
ur: بعد میں کورس میں حقیقی امتحانات کے لئے پروکیکٹنگ سے واقف ہو جاؤ. یہ پریکٹس امتحان کورس میں آپ کے گریڈ پر کوئی اثر نہیں ہے.

source: Continue to my practice exam
ur: میری آزمائشی امتحان پر جاری رکھیں

source: You will be guided through steps to set up online proctoring software and to perform various checks.
ur: آپ آن لائن پروکیکنگ سوفٹ ویئر قائم کرنے اور مختلف چیک کرنے کے لئے اقدامات کے ذریعہ ہدایت کی جائیں گی.

source: There was a problem with your practice proctoring session
ur: آپ کے مشق کے پروکیکٹنگ سیشن میں ایک مسئلہ تھا

source: Your practice proctoring results: <b class="failure"> Unsatisfactory </b>
ur: آپ کی پریکٹس کے نتائج کو پروکینگ کرنا: <b class="failure">غیر متفقہ</b>

source: Your proctoring session ended before you completed this practice exam. You can retry this practice exam if you had problems setting up the online proctoring software.
ur: آپ کا پروکیکشن سیشن ختم ہونے سے پہلے آپ نے یہ عملی امتحان مکمل کیا. آپ اس پریکٹس کے امتحان کو دوبارہ حاصل کرسکتے ہیں، اگر آپ آن لائن پروکیکٹنگ سافٹ ویئر کی ترتیبات کو حل کرنے میں مصروف ہیں.

source: Try this practice exam again
ur: اس مشق کا امتحان دوبارہ کوشش کریں

source: You have submitted this practice proctored exam
ur: آپ نے اس عمل کو امتحان پیش کیا ہے

source: Practice exams do not affect your grade or your credit eligibility. You have completed this practice exam and can continue with your course work.
ur: پریکٹس امتحان آپ کے گریڈ یا آپ کے کریڈٹ کی اہلیت کو متاثر نہیں کرتے ہیں. آپ نے اس مشق کا امتحان مکمل کیا ہے اور آپ کے کورس کے کام کے ساتھ جاری رہ سکتے ہیں.

source: You can also retry this practice exam
ur: آپ اس پریکٹس امتحان کو بھی دوبارہ حاصل کرسکتے ہیں

source: Are you sure you want to take this exam without proctoring?
ur: کیا آپ واقعی یہ آزمائشی کے بغیر پروکیکٹنگ کرنا چاہتے ہیں؟

source: If you take this exam without proctoring, you will <strong> no longer be eligible for academic credit. </strong>
ur: اگر آپ اس امتحان کے بغیر پروکیکنگ کے بغیر لے جائیں گے، تو آپ <strong>اب تعلیمی کریڈٹ کے اہل نہیں ہوں گے.</strong>

source: Continue Exam Without Proctoring
ur: پرویکٹرنگ کے بغیر امتحان جاری رکھیں

source: Go Back
ur: واپس جاو

source: This exam is proctored
ur: یہ امتحان پیش کیا جاتا ہے

source: To be eligible for course credit or for a MicroMasters credential, you must pass the proctoring review for this exam.
ur: کورس کریڈٹ کے لئے یا مائیکرو میسٹروں کے اعتبار سے اہل ہونے کے لئے، آپ کو اس امتحان کے لئے پروکیکنگ کا جائزہ لینے کے لۓ پاس کرنا ہوگا.

source: Continue to my proctored exam. I want to be eligible for credit.
ur: میری پرکشش جانچ پڑتال جاری رکھیں. میں کریڈٹ کے اہل ہوں.

source: You will be guided through steps to set up online proctoring software and to perform various checks.</br>
ur: آپ آن لائن پروکیکنگ سوفٹ ویئر قائم کرنے اور مختلف چیک کرنے کے لئے اقدامات کے ذریعہ ہدایت کی جائیں گی. </br>

source: Error with proctored exam
ur: تشخیصی امتحان کے ساتھ خرابی

source: A technical error has occurred with your proctored exam. To resolve this problem, contact <a href="mailto:%(tech_support_email)s">technical support</a>. All exam data, including answers for completed problems, has been lost. When the problem is resolved you will need to restart the exam and complete all problems again.
ur: آپ کے پروکرمی امتحان کے ساتھ ایک تکنیکی غلطی ہوئی ہے. اس مسئلہ کو حل کرنے کے لئے <a href="mailto:%(tech_support_email)s">تکنیکی مدد</a> سے رابطہ کریں. تمام امتحان کے اعداد و شمار، بشمول مکمل مسائل کے جوابات سمیت، کھو گیا ہے. جب مسئلہ حل ہوجاتا ہے تو آپ کو امتحان کو دوبارہ شروع کرنے اور تمام مسائل کو مکمل کرنے کی ضرورت ہوگی.

source: View your credit eligibility status on your <a href="%(progress_page_url)s">Progress</a> page.
ur: اپنے <a href="%(progress_page_url)s">پیش رفت کے</a> صفحے پر اپنے کریڈٹ کی اہلیت کی حیثیت دیکھیں.

source: If you have concerns about your proctoring session results, contact your course team.
ur: اگر آپ کے بارے میں تشویش ہے آپ کے پروکیکشن سیشن کے نتائج، اپنے کورس کی ٹیم سے رابطہ کریں.

source: The due date for this exam has passed
ur: اس امتحان کے لئے تاریخ کی تاریخ منظور ہو گئی ہے

source: Because the due date has passed, you are no longer able to take this exam.
ur: کیونکہ تاریخ کی تاریخ منظور ہو چکی ہے، آپ اب اس امتحان لینے کے قابل نہیں ہیں.

source: You did not satisfy the requirements for taking this exam with proctoring, and are not eligible for credit. See your <a href="%(progress_page_url)s">Progress</a> page for a list of requirements and your status for each.
ur: آپ نے اس امتحان کو پروکیکٹنگ لینے کے لۓ پورا نہیں کیا، اور کریڈٹ کے اہل نہیں ہیں. اپنے <a href="%(progress_page_url)s">پیش رفت کے</a> صفحے کی ضروریات کی فہرست اور ہر ایک کے لئے آپ کی حیثیت کے لئے ملاحظہ کریں.

source: You did not satisfy the following prerequisites:
ur: آپ مندرجہ ذیل ضروریات کو پورا نہیں کرتے تھے:

source: Due to unsatisfied prerequisites, you can only take this exam without proctoring.
ur: ناپسندیدہ شرطوں کی وجہ سے، آپ صرف اس امتحان کے بغیر پروکیکٹنگ لے سکتے ہیں.

source: If you have questions about the status of your requirements for course credit, contact %(platform_name)s Support.
ur: اگر آپ کے پاس کریڈٹ کریڈٹ کے لئے اپنی ضروریات کی حیثیت کے بارے میں سوالات ہیں تو، %(platform_name)s سپورٹ سے رابطہ کریں.

source: About Proctored Exams
ur: پروکارڈ امتحان کے بارے میں

source: Complete your verification before starting the proctored exam.
ur: تجزیہ کردہ امتحان شروع کرنے سے پہلے اپنی توثیق مکمل کریں.

source: You must successfully complete identity verification before you can start the proctored exam.
ur: اس سے پہلے کہ آپ پروکارڈ امتحان شروع کر سکیں اس سے پہلے آپ کو شناخت کی توثیق مکمل کرنی چاہیے.

source: Your verification is pending. Results should be available 2-3 days after you submit your verification.
ur: آپ کی توثیق زیر التواء ہے. آپ کی توثیق جمع کرنے کے بعد نتائج 2-3 دن دستیاب ہونا چاہئے.

source: Your verification attempt failed. Please read our guidelines to make sure you understand the requirements for successfully completing verification, then try again.
ur: آپ کی توثیق کی کوشش ناکام ہوگئی. اس بات کا یقین کرنے کے لئے کہ آپ کو کامیابی سے توثیق مکمل کرنے کے لئے ضروریات کو سمجھنے کے لۓ اپنے ہدایات کو پڑھیں، پھر دوبارہ کوشش کریں.

source: Retry Verification
ur: تصدیق دوبارہ کریں

source: Your verification has expired. You must successfully complete a new identity verification before you can start the proctored exam.
ur: آپ کی توثیق ختم ہوگئی ہے. اس سے پہلے کہ آپ پروکارڈ امتحان شروع کر سکیں اس سے پہلے آپ کو ایک نئی شناخت کی توثیق مکمل کرنا ضروری ہے.

source: Continue to Verification
ur: توثیق جاری رکھیں

source: Make sure you are on a computer with a webcam, and that you have valid photo identification such as a driver's license or passport, before you continue.
ur: اس بات کو یقینی بنائیں کہ آپ ویب کیم کے ساتھ کمپیوٹر پر ہیں، اور آپ کے پاس جاری رکھنے سے پہلے آپ کے پاس درست تصویر کی شناخت جیسے ڈرائیور ایس 1 لائسنس یا پاسپورٹ ہے.

source: Follow these steps to set up and start your proctored exam.
ur: قائم کرنے اور اپنے پروکرمی امتحان شروع کرنے کے لئے ان اقدامات پر عمل کریں.

source: 1. Copy this unique exam code. You will be prompted to paste this code later before you start the exam.
ur: 1. اس منفرد امتحان کا کوڈ کاپی کریں. آپ کو اس کوڈ کو پیسٹ کرنے کے بعد آپ کو امتحان شروع کرنے سے پہلے پیسہ دیا جائے گا.

source: Select the exam code, then copy it using Command+C (Mac) or Control+C (Windows).
ur: امتحان کوڈ منتخب کریں، پھر کمانڈ + سی (میک) یا کنٹرول + سی (ونڈوز) کا استعمال کرتے ہوئے کاپی کریں.

source: 2. Follow the link below to set up proctoring.
ur: 2. پروکیکٹنگ قائم کرنے کے لئے نیچے دیئے گئے لنک پر عمل کریں.

source: Start System Check
ur: سسٹم چیک شروع کریں

source: A new window will open. You will run a system check before downloading the proctoring application.
ur: ایک نئی ونڈو کھل جائے گی. آپ کو پروکیکٹنگ ایپلیکیشن ڈاؤن لوڈ کرنے سے پہلے ایک سسٹم چیک چیک کریں گے.

source: You will be asked to verify your identity as part of the proctoring exam set up. Make sure you are on a computer with a webcam, and that you have valid photo identification such as a driver's license or passport, before you continue.
ur: آپ کو اپنی شناخت کی توثیق کرنے کے لئے کہا جائے گا کہ آپ پروکیکنگ امتحان کے حصے کے طور پر مقرر کریں. اس بات کو یقینی بنائیں کہ آپ ویب کیم کے ساتھ کمپیوٹر پر ہیں، اور آپ کے پاس جاری رکھنے سے پہلے آپ کے پاس درست تصویر کی شناخت جیسے ڈرائیور ایس 1 لائسنس یا پاسپورٹ ہے.

source: 3. When you have finished setting up proctoring, start the exam.
ur: 3. جب آپ پروکیکٹنگ کی ترتیب کو ختم کر چکے ہیں، تو امتحان شروع کریں.

source: Start Proctored Exam
ur: پروکارڈ امتحان شروع کریں

source: Close
ur: بند کریں

source: Cannot Start Proctored Exam
ur: پروکارڈ امتحان شروع نہیں کر سکتے ہیں

source: Take this exam without proctoring.
ur: بغیر امتحان کے بغیر یہ امتحان لیں.

source: Doing so means that you are no longer eligible for academic credit.
ur: اس کا مطلب یہ ہے کہ آپ اب تعلیمی کریڈٹ کے اہل نہیں ہیں.

source: You have not completed the prerequisites for this exam. All requirements must be satisfied before you can take this proctored exam and be eligible for credit. See your <a href="%(progress_page_url)s">Progress</a> page for a list of requirements in the order that they must be completed.
ur: آپ نے اس امتحان کے لئے ضروریات مکمل نہیں کی ہیں. آپ اس پروکرمی امتحان لے سکتے ہیں اور کریڈٹ کے اہل ہونے سے قبل تمام ضروریات کو مطمئن ہونا ضروری ہے. آپ کے <a href="%(progress_page_url)s">پیش رفت کے</a> صفحے کی ضروریات کی فہرست کے لۓ دیکھیں تاکہ انہیں مکمل کرنا ضروری ہے.

source: The following prerequisites are in a <strong>pending</strong> state and must be successfully completed before you can proceed:
ur: مندرجہ ذیل شرطیں <strong>زیر التواء</strong> ریاست میں ہیں اور آپ آگے بڑھ سکتے ہیں اس سے پہلے کامیابی سے مکمل ہونا ضروری ہے:

source: You can take this exam with proctoring only when all prerequisites have been successfully completed. Check your <a href="%(progress_page_url)s">Progress</a> page to see if prerequisite results have been updated. You can also take this exam now without proctoring, but you will not be eligible for credit.
ur: آپ یہ امتحان لے سکتے ہیں کہ صرف پروکیکٹنگ کے ساتھ ہی صرف جب سب ضروریات مکمل طور پر مکمل ہوئیں. اپنے <a href="%(progress_page_url)s">پیش رفت کے</a> صفحے کی جانچ پڑتال کرنے کے لئے چیک کریں کہ لازمی نتائج کو اپ ڈیٹ کیا گیا ہے. آپ اب بھی اس امتحان کے بغیر پروکیکونگ لے سکتے ہیں، لیکن آپ کریڈٹ کے اہل نہیں ہوں گے.

source: Your Proctoring Session Has Started
ur: آپ کا پروکیکٹنگ اجلاس شروع ہوگیا ہے

source: From this point in time, you must follow the <a href="%(link_urls.online_proctoring_rules)s" target="_blank">online proctoring rules</a> to pass the proctoring review for your exam.
ur: اس وقت سے، آپ کو اپنے امتحان کے لئے پروکیکنگ کا جائزہ لینے کے لۓ <a href="%(link_urls.online_proctoring_rules)s" target="_blank">آن لائن پروکیکٹنگ قوانین</a> کو عمل کرنا ضروری ہے.

source: Do not close this window before you finish your exam. if you close this window, your proctoring session ends, and you will not successfully complete the proctored exam.
ur: آپ اپنی امتحان کو ختم کرنے سے پہلے یہ ونڈو بند نہ کریں. اگر آپ اس ونڈو کو بند کرتے ہیں تو، آپ کے پروکیکشن سیشن ختم ہوجاتا ہے، اور آپ کو پروجیکٹ شدہ امتحان مکمل طور پر مکمل نہیں کریں گے.

source: Return to the %(platform_name)s course window to start your exam. When you have finished your exam and have marked it as complete, you can close this window to end the proctoring session and upload your proctoring session data for review.
ur: اپنی امتحان شروع کرنے کے لئے %(platform_name)s کورس ونڈو میں واپس جائیں. جب آپ نے اپنی امتحان کو مکمل کر لیا اور اسے مکمل طور پر نشان لگا دیا ہے تو، آپ کو پروکیکٹنگ سیشن کو ختم کرنے کے لئے اس ونڈو کو بند کر سکتے ہیں اور جائزہ لینے کے لئے اپنے پروکیکنگ سیشن ڈیٹا اپ لوڈ کرسکتے ہیں.

source: I am not interested in academic credit.
ur: مجھے تعلیمی کریڈٹ میں دلچسپی نہیں ہے.

source: Follow these instructions
ur: ان ہدایات پر عمل کریں

source: &#8226; When you start your exam you will have %(total_time)s to complete it. </br> &#8226; You cannot stop the timer once you start. </br> &#8226; If time expires before you finish your exam, your completed answers will be submitted for review. </br>
ur: &amp; #8226؛ جب آپ اپنی امتحان شروع کرتے ہیں تو آپ اسے مکمل کرنے کے لئے %(total_time)s پڑے گا. </br> &amp; #8226؛ آپ ٹائمر کو ایک بار شروع نہیں کر سکتے ہیں. </br> &amp; #8226؛ اگر آپ اپنی امتحان ختم کرنے سے قبل وقت ختم ہوجاتا ہے، تو آپ کے مکمل جوابات جائزہ لینے کے لئے جمع کیے جائیں گے. </br>

source: Start my exam
ur: میری امتحان شروع کرو

source: Are you sure you want to end your proctored exam?
ur: کیا آپ واقعی اپنے پروکرمی امتحان ختم کرنا چاہتے ہیں؟

source: Make sure that you have selected "Submit" for each problem before you submit your exam.
ur: اس بات کو یقینی بنائیں کہ آپ اپنی امتحان جمع کرنے سے قبل ہر مسئلے کے لئے "Submit" کا انتخاب کیا ہے.

source: After you submit your exam, your responses are graded and your proctoring session is reviewed. You might be eligible to earn academic credit for this course if you complete all required exams as well as achieve a final grade that meets credit requirements for the course.
ur: آپ اپنی امتحان جمع کرنے کے بعد، آپ کے جوابات درجہ بندی کیے جاتے ہیں اور آپ کے پروکیکشن کا جائزہ لیا جاتا ہے. آپ اس کورس کے لئے تعلیمی کریڈٹ حاصل کرنے کے اہل ہوسکتے ہیں اگر آپ لازمی امتحان مکمل کریں اور حتمی گریڈ حاصل کریں جو کورس کے لئے کریڈٹ کی ضروریات کو پورا کریں.

source: Yes, end my proctored exam
ur: جی ہاں، میری پروکرمی امتحان ختم

source: No, I'd like to continue working
ur: نہیں، I'D کام جاری رکھنے کی طرح

source: Your proctoring session was reviewed and did not pass requirements
ur: آپ کے پروکیکٹنگ سیشن کا جائزہ لیا گیا اور ضروریات کو منظور نہیں کیا گیا

source: You are no longer eligible for academic credit for this course, regardless of your final grade. If you have questions about the status of your proctored exam results, contact %(platform_name)s Support.
ur: آپ کو اس کورس کے لئے علمی کریڈٹ کے لۓ مزید مستحق نہیں ہیں، قطع نظر آپ کے آخری گریڈ کے. اگر آپ کے سوالات کے بارے میں سوالات کے بارے میں سوالات ہیں تو، %(platform_name)s سپورٹ سے رابطہ کریں.

source: You have submitted this proctored exam for review
ur: آپ نے اس تجویز کردہ امتحان کا جائزہ لیا ہے

source: If the proctoring software window is still open, you can close it now. Confirm that you want to quit the application when you are prompted.
ur: اگر پروکیکنگ سوفٹ ویئر ونڈو ابھی بھی کھلا ہے تو، آپ اب اسے بند کر سکتے ہیں. اس بات کی توثیق کریں کہ آپ ایپلی کیشنز کو چھوڑنے کے بعد چھوڑنا چاہتے ہیں.

source: &#8226; After you quit the proctoring session, the recorded data is uploaded for review. </br> &#8226; Proctoring results are usually available within 5 business days after you submit your exam.
ur: &amp; #8226؛ پروکیکٹنگ سیشن چھوڑنے کے بعد، ریکارڈ کردہ ڈیٹا جائزے کے لئے اپ لوڈ کیا جاتا ہے. </br> &amp; #8226؛ آپ کے امتحان جمع کرنے کے بعد پرویکٹرنگ کے نتائج عام طور پر 5 کاروباری دنوں کے اندر اندر دستیاب ہیں.

source: If you have questions about the status of your proctored exam results, contact %(platform_name)s Support.
ur: اگر آپ کے سوالات کے بارے میں سوالات کے بارے میں سوالات ہیں تو، %(platform_name)s سپورٹ سے رابطہ کریں.

source: Your proctoring session was reviewed and passed all requirements
ur: آپ کے پروکیکٹنگ سیشن کا جائزہ لیا اور تمام ضروریات کو منظور کیا گیا تھا

source: You are eligible to purchase academic credit for this course if you complete all required exams and also achieve a final grade that meets the credit requirements for the course.
ur: آپ اس کورس کے لئے تعلیمی کریڈٹ خریدنے کے اہل ہیں اگر آپ لازمی امتحان مکمل کریں اور حتمی گریڈ بھی حاصل کریں جو کورس کے لئے کریڈٹ کی ضروریات کو پورا کریں.

source: To view your exam questions and responses, select <strong>View my exam</strong>. The exam's review status is shown in the left navigation pane.
ur: اپنے امتحان کے سوالات اور جوابات دیکھنے کے لئے، <strong>میری امتحان دیکھیں</strong> . بائیں نیویگیشن پین میں امتحان کی حیثیت کا جائزہ لینے کا مقام دکھایا گیا ہے.

source: View my exam
ur: میری امتحان دیکھیں

source: After the due date for this exam has passed, you will be able to review your answers on this page.
ur: اس امتحان کے لئے مقررہ تاریخ منظور ہونے کے بعد، آپ اس صفحہ پر آپ کے جوابات کا جائزہ لے سکیں گے.

source: %(exam_name)s is a Timed Exam (%(total_time)s)
ur: %(exam_name)s ایک ٹائم ٹیسٹ (%(total_time)s) ہے.

source: This exam has a time limit associated with it.
ur: یہ امتحان اس کے ساتھ منسلک ایک وقت کی حد ہے.

source: To pass this exam, you must complete the problems in the time allowed.
ur: اس امتحان کو منتقل کرنے کے لئے، آپ کو وقت کی اجازت دی جانے والی مشکلات کو پورا کرنا ضروری ہے.

source: After you select
ur: آپ کو منتخب کرنے کے بعد

source: I am ready to start this timed exam,
ur: میں اس ٹائم شدہ امتحان شروع کرنے کے لئے تیار ہوں،

source: you will have
ur: آپ کو پڑے گا

source: to complete and submit the exam.
ur: امتحان مکمل کرنے اور جمع کرنے کے لئے.

source: I am ready to start this timed exam.
ur: میں اس ٹائم شدہ امتحان شروع کرنے کے لئے تیار ہوں.

source: Can I request additional time to complete my exam?
ur: کیا میں اپنی امتحان کو مکمل کرنے کے لئے اضافی وقت کی درخواست کر سکتا ہوں؟

source: If you have disabilities, you might be eligible for an additional time allowance on timed exams. Ask your course team for information about additional time allowances.
ur: اگر آپ معذور ہیں تو، آپ کو ٹائم شدہ امتحانوں پر اضافی وقت کی الاؤنس کے اہل ہوسکتا ہے. اضافی وقت کے الاؤنس کے بارے میں معلومات کے لئے اپنے کورس کی ٹیم سے پوچھیں.

source: Are you sure that you want to submit your timed exam?
ur: کیا آپ اس بات کو یقینی بناتے ہیں کہ آپ اپنا ٹائم شدہ امتحان جمع کرنا چاہتے ہیں؟

source: After you submit your exam, your exam will be graded.
ur: آپ اپنی امتحان جمع کرنے کے بعد، آپ کا امتحان درجہ بندی کیا جائے گا.

source: Yes, submit my timed exam.
ur: جی ہاں، اپنا ٹائم ٹیسٹ کریں.

source: No, I want to continue working.
ur: نہیں، میں کام جاری رکھنا چاہتا ہوں.

source: The time allotted for this exam has expired. Your exam has been submitted and any work you completed will be graded.
ur: اس امتحان کے لئے مختص کردہ وقت ختم ہو گیا ہے. آپ کی امتحان جمع کردی گئی ہے اور آپ کے مکمل کردہ کام کو درجہ بندی کیا جائے گا.

source: You have submitted your timed exam.
ur: آپ نے اپنا ٹائم ٹیسٹ کیا ہے.

source: Your grade for this timed exam will be immediately available on the <a href="%(progress_page_url)s">Progress</a> page.
ur: اس ٹائم ٹیسٹ کے لئے آپ کا گریڈ <a href="%(progress_page_url)s">پیش رفت کے</a> صفحے پر فوری طور پر دستیاب ہوگا.

source: After the due date has passed, you can review the exam, but you cannot change your answers.
ur: متوقع تاریخ منظور ہونے کے بعد، آپ امتحان کا جائزہ لے سکتے ہیں، لیکن آپ اپنے جوابات کو تبدیل نہیں کرسکتے ہیں.

source: {num_of_hours} hour
ur: {num_of_hours} گھنٹے

source: {num_of_hours} hours
ur: {num_of_hours} گھنٹے

source: {num_of_minutes} minutes
ur: {num_of_minutes} منٹ

source: and {num_of_minutes} minute
ur: اور {num_of_minutes} منٹ

source: {num_of_minutes} minute
ur: {num_of_minutes} منٹ

source: and {num_of_minutes} minutes
ur: اور {num_of_minutes} منٹ

source: could not determine the course_id
ur: کورس_ڈ کا تعین نہیں کیا جا سکا

source: Must be a Staff User to Perform this request.
ur: اس درخواست کو انجام دینے کے لئے اسٹاف صارف ہونا ضروری ہے.

source: you have {remaining_time} remaining
ur: آپ کے پاس {remaining_time} باقی ہے

source: you have less than a minute remaining
ur: آپ کے پاس باقی ایک منٹ سے بھی کم ہے

source: timed
ur: ٹائمز

source: practice
ur: مشق
